#+title: mans search for meaning by viktor frankl
#+ROAM_TAGS: philosophy "self help"
#+ROAM_KEY: manssearch

* Notes while I read "Man's Search for Meaning"
  :LOGBOOK:
  CLOCK: [2021-06-30 Wed 20:46]--[2021-06-30 Wed 20:47] =>  0:00
  :END:

** section 1 life in a concentration camp
   :LOGBOOK:
   CLOCK: [2021-06-23 Wed 12:50]--[2021-06-23 Wed 13:46] =>  0:56
   :END:

** <2021-06-24 Thu> thursday bookclub meeting
   :LOGBOOK:
   CLOCK: [2021-06-24 Thu 20:00]--[2021-06-24 Thu 21:10] =>  1:10
   :END:
   Cameron, Ian, and Thomas
** <2021-07-01 Thu> thursday bookclub meeting
   :LOGBOOK:
   CLOCK: [2021-07-01 Thu 20:00]--[2021-07-01 Thu 21:45] =>  1:45
   :END:
   Caleb and Cameron
** <2021-07-08 Thu> thursday bookclub meeting
   :LOGBOOK:
   CLOCK: [2021-07-08 Thu 20:00]--[2021-07-08 Thu 21:58] =>  1:58
   :END:
